leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Offset for Ifx_SCU_CCUCON0_Bits.LPDIV */
#define IFX_SCU_CCUCON0_LPDIV_OFF (12u)

/** \brief  Length for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON0_Bits.SPBDIV */
#define IFX_SCU_CCUCON0_SPBDIV_OFF (16u)

/** \brief  Length for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON0_Bits.SRIDIV */
#define IFX_SCU_CCUCON0_SRIDIV_OFF (8u)

/** \brief  Length for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON0_Bits.UP */
#define IFX_SCU_CCUCON0_UP_OFF (30u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.ASCLINFDIV */
#define IFX_SCU_CCUCON1_ASCLINFDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.ASCLINFDIV */
#define IFX_SCU_CCUCON1_ASCLINFDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.ASCLINFDIV */
#define IFX_SCU_CCUCON1_ASCLINFDIV_OFF (20u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.ASCLINSDIV */
#define IFX_SCU_CCUCON1_ASCLINSDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.ASCLINSDIV */
#define IFX_SCU_CCUCON1_ASCLINSDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.ASCLINSDIV */
#define IFX_SCU_CCUCON1_ASCLINSDIV_OFF (24u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.CANDIV */
#define IFX_SCU_CCUCON1_CANDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.CANDIV */
#define IFX_SCU_CCUCON1_CANDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.CANDIV */
#define IFX_SCU_CCUCON1_CANDIV_OFF (0u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.ERAYDIV */
#define IFX_SCU_CCUCON1_ERAYDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.ERAYDIV */
#define IFX_SCU_CCUCON1_ERAYDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.ERAYDIV */
#define IFX_SCU_CCUCON1_ERAYDIV_OFF (4u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.ETHDIV */
#define IFX_SCU_CCUCON1_ETHDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.ETHDIV */
#define IFX_SCU_CCUCON1_ETHDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.ETHDIV */
#define IFX_SCU_CCUCON1_ETHDIV_OFF (16u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.GTMDIV */
#define IFX_SCU_CCUCON1_GTMDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.GTMDIV */
#define IFX_SCU_CCUCON1_GTMDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.GTMDIV */
#define IFX_SCU_CCUCON1_GTMDIV_OFF (12u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.INSEL */
#define IFX_SCU_CCUCON1_INSEL_LEN (2u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.INSEL */
#define IFX_SCU_CCUCON1_INSEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.INSEL */
#define IFX_SCU_CCUCON1_INSEL_OFF (28u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.LCK */
#define IFX_SCU_CCUCON1_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.STMDIV */
#define IFX_SCU_CCUCON1_STMDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.STMDIV */
#define IFX_SCU_CCUCON1_STMDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.STMDIV */
#define IFX_SCU_CCUCON1_STMDIV_OFF (8u)

/** \brief  Length for Ifx_SCU_CCUCON1_Bits.UP */
#define IFX_SCU_CCUCON1_UP_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON1_Bits.UP */
#define IFX_SCU_CCUCON1_UP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON1_Bits.UP */
#define IFX_SCU_CCUCON1_UP_OFF (30u)

/** \brief  Length for Ifx_SCU_CCUCON2_Bits.BBBDIV */
#define IFX_SCU_CCUCON2_BBBDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON2_Bits.BBBDIV */
#define IFX_SCU_CCUCON2_BBBDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON2_Bits.BBBDIV */
#define IFX_SCU_CCUCON2_BBBDIV_OFF (0u)

/** \brief  Length for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON2_Bits.LCK */
#define IFX_SCU_CCUCON2_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_CCUCON2_Bits.UP */
#define IFX_SCU_CCUCON2_UP_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON2_Bits.UP */
#define IFX_SCU_CCUCON2_UP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON2_Bits.UP */
#define IFX_SCU_CCUCON2_UP_OFF (30u)

/** \brief  Length for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON3_Bits.LCK */
#define IFX_SCU_CCUCON3_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_CCUCON3_Bits.PLLDIV */
#define IFX_SCU_CCUCON3_PLLDIV_LEN (6u)

/** \brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLDIV */
#define IFX_SCU_CCUCON3_PLLDIV_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLDIV */
#define IFX_SCU_CCUCON3_PLLDIV_OFF (0u)

/** \brief  Length for Ifx_SCU_CCUCON3_Bits.PLLERAYDIV */
#define IFX_SCU_CCUCON3_PLLERAYDIV_LEN (6u)

/** \brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLERAYDIV */
#define IFX_SCU_CCUCON3_PLLERAYDIV_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLERAYDIV */
#define IFX_SCU_CCUCON3_PLLERAYDIV_OFF (8u)

/** \brief  Length for Ifx_SCU_CCUCON3_Bits.PLLERAYSEL */
#define IFX_SCU_CCUCON3_PLLERAYSEL_LEN (2u)

/** \brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLERAYSEL */
#define IFX_SCU_CCUCON3_PLLERAYSEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLERAYSEL */
#define IFX_SCU_CCUCON3_PLLERAYSEL_OFF (14u)

/** \brief  Length for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_LEN (2u)

/** \brief  Mask for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CCUCON3_Bits.PLLSEL */
#define IFX_SCU_CCUCON3_PLLSEL_OFF (6u)

/** \brief  Length for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_LEN (6u)

/** \brief  Mask for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_CCUCON3_Bits.SRIDIV */
#define IFX_SCU_CCUCON3_SRIDIV_OFF (16u)

/** \brief  Length for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_LEN (2u)

