leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Mask for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CCUCON3_Bits.SRISEL */
#define IFX_SCU_CCUCON3_SRISEL_OFF (22u)

/** \brief  Length for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON3_Bits.UP */
#define IFX_SCU_CCUCON3_UP_OFF (30u)

/** \brief  Length for Ifx_SCU_CCUCON4_Bits.GTMDIV */
#define IFX_SCU_CCUCON4_GTMDIV_LEN (6u)

/** \brief  Mask for Ifx_SCU_CCUCON4_Bits.GTMDIV */
#define IFX_SCU_CCUCON4_GTMDIV_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_CCUCON4_Bits.GTMDIV */
#define IFX_SCU_CCUCON4_GTMDIV_OFF (8u)

/** \brief  Length for Ifx_SCU_CCUCON4_Bits.GTMSEL */
#define IFX_SCU_CCUCON4_GTMSEL_LEN (2u)

/** \brief  Mask for Ifx_SCU_CCUCON4_Bits.GTMSEL */
#define IFX_SCU_CCUCON4_GTMSEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CCUCON4_Bits.GTMSEL */
#define IFX_SCU_CCUCON4_GTMSEL_OFF (14u)

/** \brief  Length for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON4_Bits.LCK */
#define IFX_SCU_CCUCON4_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_LEN (6u)

/** \brief  Mask for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_CCUCON4_Bits.SPBDIV */
#define IFX_SCU_CCUCON4_SPBDIV_OFF (0u)

/** \brief  Length for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_LEN (2u)

/** \brief  Mask for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CCUCON4_Bits.SPBSEL */
#define IFX_SCU_CCUCON4_SPBSEL_OFF (6u)

/** \brief  Length for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_LEN (6u)

/** \brief  Mask for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_CCUCON4_Bits.STMDIV */
#define IFX_SCU_CCUCON4_STMDIV_OFF (16u)

/** \brief  Length for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_LEN (2u)

/** \brief  Mask for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CCUCON4_Bits.STMSEL */
#define IFX_SCU_CCUCON4_STMSEL_OFF (22u)

/** \brief  Length for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON4_Bits.UP */
#define IFX_SCU_CCUCON4_UP_OFF (30u)

/** \brief  Length for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON5_Bits.LCK */
#define IFX_SCU_CCUCON5_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_CCUCON5_Bits.MAXDIV */
#define IFX_SCU_CCUCON5_MAXDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_CCUCON5_Bits.MAXDIV */
#define IFX_SCU_CCUCON5_MAXDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CCUCON5_Bits.MAXDIV */
#define IFX_SCU_CCUCON5_MAXDIV_OFF (0u)

/** \brief  Length for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_LEN (1u)

/** \brief  Mask for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CCUCON5_Bits.UP */
#define IFX_SCU_CCUCON5_UP_OFF (30u)

/** \brief  Length for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_LEN (6u)

/** \brief  Mask for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_CCUCON6_Bits.CPU0DIV */
#define IFX_SCU_CCUCON6_CPU0DIV_OFF (0u)

/** \brief  Length for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_LEN (8u)

/** \brief  Mask for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_OFF (8u)

/** \brief  Length for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_LEN (6u)

/** \brief  Mask for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_OFF (0u)

/** \brief  Length for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_LEN (2u)

/** \brief  Mask for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_OFF (6u)

/** \brief  Length for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_LEN (1u)

/** \brief  Mask for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_OFF (16u)

/** \brief  Length for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_LEN (4u)

/** \brief  Mask for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_OFF (24u)

/** \brief  Length for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_LEN (1u)

/** \brief  Mask for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_OFF (30u)

/** \brief  Length for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_LEN (2u)

/** \brief  Mask for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_OFF (28u)

/** \brief  Length for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_LEN (7u)

/** \brief  Mask for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_OFF (17u)

/** \brief  Length for Ifx_SCU_DTSCON_Bits.CAL */
#define IFX_SCU_DTSCON_CAL_LEN (22u)

/** \brief  Mask for Ifx_SCU_DTSCON_Bits.CAL */
#define IFX_SCU_DTSCON_CAL_MSK (0x3fffffu)

/** \brief  Offset for Ifx_SCU_DTSCON_Bits.CAL */
#define IFX_SCU_DTSCON_CAL_OFF (4u)

/** \brief  Length for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_OFF (0u)

/** \brief  Length for Ifx_SCU_DTSCON_Bits.SLCK */
#define IFX_SCU_DTSCON_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_DTSCON_Bits.SLCK */
#define IFX_SCU_DTSCON_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_DTSCON_Bits.SLCK */
#define IFX_SCU_DTSCON_SLCK_OFF (31u)

/** \brief  Length for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_LEN (1u)

/** \brief  Mask for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_OFF (1u)

/** \brief  Length for Ifx_SCU_DTSLIM_Bits.LLU */
#define IFX_SCU_DTSLIM_LLU_LEN (1u)

/** \brief  Mask for Ifx_SCU_DTSLIM_Bits.LLU */
#define IFX_SCU_DTSLIM_LLU_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_DTSLIM_Bits.LLU */
#define IFX_SCU_DTSLIM_LLU_OFF (15u)

