leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Length for Ifx_SCU_DTSLIM_Bits.LOWER */
#define IFX_SCU_DTSLIM_LOWER_LEN (10u)

/** \brief  Mask for Ifx_SCU_DTSLIM_Bits.LOWER */
#define IFX_SCU_DTSLIM_LOWER_MSK (0x3ffu)

/** \brief  Offset for Ifx_SCU_DTSLIM_Bits.LOWER */
#define IFX_SCU_DTSLIM_LOWER_OFF (0u)

/** \brief  Length for Ifx_SCU_DTSLIM_Bits.SLCK */
#define IFX_SCU_DTSLIM_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_DTSLIM_Bits.SLCK */
#define IFX_SCU_DTSLIM_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_DTSLIM_Bits.SLCK */
#define IFX_SCU_DTSLIM_SLCK_OFF (30u)

/** \brief  Length for Ifx_SCU_DTSLIM_Bits.UOF */
#define IFX_SCU_DTSLIM_UOF_LEN (1u)

/** \brief  Mask for Ifx_SCU_DTSLIM_Bits.UOF */
#define IFX_SCU_DTSLIM_UOF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_DTSLIM_Bits.UOF */
#define IFX_SCU_DTSLIM_UOF_OFF (31u)

/** \brief  Length for Ifx_SCU_DTSLIM_Bits.UPPER */
#define IFX_SCU_DTSLIM_UPPER_LEN (10u)

/** \brief  Mask for Ifx_SCU_DTSLIM_Bits.UPPER */
#define IFX_SCU_DTSLIM_UPPER_MSK (0x3ffu)

/** \brief  Offset for Ifx_SCU_DTSLIM_Bits.UPPER */
#define IFX_SCU_DTSLIM_UPPER_OFF (16u)

/** \brief  Length for Ifx_SCU_DTSSTAT_Bits.BUSY */
#define IFX_SCU_DTSSTAT_BUSY_LEN (1u)

/** \brief  Mask for Ifx_SCU_DTSSTAT_Bits.BUSY */
#define IFX_SCU_DTSSTAT_BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_DTSSTAT_Bits.BUSY */
#define IFX_SCU_DTSSTAT_BUSY_OFF (15u)

/** \brief  Length for Ifx_SCU_DTSSTAT_Bits.RDY */
#define IFX_SCU_DTSSTAT_RDY_LEN (1u)

/** \brief  Mask for Ifx_SCU_DTSSTAT_Bits.RDY */
#define IFX_SCU_DTSSTAT_RDY_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_DTSSTAT_Bits.RDY */
#define IFX_SCU_DTSSTAT_RDY_OFF (14u)

/** \brief  Length for Ifx_SCU_DTSSTAT_Bits.RESULT */
#define IFX_SCU_DTSSTAT_RESULT_LEN (10u)

/** \brief  Mask for Ifx_SCU_DTSSTAT_Bits.RESULT */
#define IFX_SCU_DTSSTAT_RESULT_MSK (0x3ffu)

/** \brief  Offset for Ifx_SCU_DTSSTAT_Bits.RESULT */
#define IFX_SCU_DTSSTAT_RESULT_OFF (0u)

/** \brief  Length for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_LEN (1u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.EIEN0 */
#define IFX_SCU_EICR_EIEN0_OFF (11u)

/** \brief  Length for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_LEN (1u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.EIEN1 */
#define IFX_SCU_EICR_EIEN1_OFF (27u)

/** \brief  Length for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_LEN (3u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.EXIS0 */
#define IFX_SCU_EICR_EXIS0_OFF (4u)

/** \brief  Length for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_LEN (3u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.EXIS1 */
#define IFX_SCU_EICR_EXIS1_OFF (20u)

/** \brief  Length for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_LEN (1u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.FEN0 */
#define IFX_SCU_EICR_FEN0_OFF (8u)

/** \brief  Length for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_LEN (1u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.FEN1 */
#define IFX_SCU_EICR_FEN1_OFF (24u)

/** \brief  Length for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_LEN (3u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.INP0 */
#define IFX_SCU_EICR_INP0_OFF (12u)

/** \brief  Length for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_LEN (3u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.INP1 */
#define IFX_SCU_EICR_INP1_OFF (28u)

/** \brief  Length for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_LEN (1u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.LDEN0 */
#define IFX_SCU_EICR_LDEN0_OFF (10u)

/** \brief  Length for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_LEN (1u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.LDEN1 */
#define IFX_SCU_EICR_LDEN1_OFF (26u)

/** \brief  Length for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_LEN (1u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.REN0 */
#define IFX_SCU_EICR_REN0_OFF (9u)

/** \brief  Length for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_LEN (1u)

/** \brief  Mask for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EICR_Bits.REN1 */
#define IFX_SCU_EICR_REN1_OFF (25u)

/** \brief  Length for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_LEN (1u)

/** \brief  Mask for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EIFR_Bits.INTF0 */
#define IFX_SCU_EIFR_INTF0_OFF (0u)

/** \brief  Length for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_LEN (1u)

/** \brief  Mask for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EIFR_Bits.INTF1 */
#define IFX_SCU_EIFR_INTF1_OFF (1u)

/** \brief  Length for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_LEN (1u)

/** \brief  Mask for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EIFR_Bits.INTF2 */
#define IFX_SCU_EIFR_INTF2_OFF (2u)

/** \brief  Length for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_LEN (1u)

/** \brief  Mask for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EIFR_Bits.INTF3 */
#define IFX_SCU_EIFR_INTF3_OFF (3u)

/** \brief  Length for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_LEN (1u)

/** \brief  Mask for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EIFR_Bits.INTF4 */
#define IFX_SCU_EIFR_INTF4_OFF (4u)

/** \brief  Length for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_LEN (1u)

