leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Mask for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EIFR_Bits.INTF5 */
#define IFX_SCU_EIFR_INTF5_OFF (5u)

/** \brief  Length for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_LEN (1u)

/** \brief  Mask for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EIFR_Bits.INTF6 */
#define IFX_SCU_EIFR_INTF6_OFF (6u)

/** \brief  Length for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_LEN (1u)

/** \brief  Mask for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EIFR_Bits.INTF7 */
#define IFX_SCU_EIFR_INTF7_OFF (7u)

/** \brief  Length for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EMSR_Bits.EMSF */
#define IFX_SCU_EMSR_EMSF_OFF (16u)

/** \brief  Length for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_LEN (2u)

/** \brief  Mask for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EMSR_Bits.EMSFM */
#define IFX_SCU_EMSR_EMSFM_OFF (24u)

/** \brief  Length for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_LEN (1u)

/** \brief  Mask for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EMSR_Bits.ENON */
#define IFX_SCU_EMSR_ENON_OFF (2u)

/** \brief  Length for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_LEN (1u)

/** \brief  Mask for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EMSR_Bits.MODE */
#define IFX_SCU_EMSR_MODE_OFF (1u)

/** \brief  Length for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EMSR_Bits.POL */
#define IFX_SCU_EMSR_POL_OFF (0u)

/** \brief  Length for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EMSR_Bits.PSEL */
#define IFX_SCU_EMSR_PSEL_OFF (3u)

/** \brief  Length for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EMSR_Bits.SEMSF */
#define IFX_SCU_EMSR_SEMSF_OFF (17u)

/** \brief  Length for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_LEN (2u)

/** \brief  Mask for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EMSR_Bits.SEMSFM */
#define IFX_SCU_EMSR_SEMSFM_OFF (26u)

/** \brief  Length for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_LEN (2u)

/** \brief  Mask for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_ESRCFG_Bits.EDCON */
#define IFX_SCU_ESRCFG_EDCON_OFF (7u)

/** \brief  Length for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_LEN (1u)

/** \brief  Mask for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_OFF (1u)

/** \brief  Length for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_LEN (1u)

/** \brief  Mask for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_OFF (0u)

/** \brief  Length for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_OFF (29u)

/** \brief  Length for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_OFF (28u)

/** \brief  Length for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_OFF (4u)

