leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_OFF (30u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_OFF (20u)

/** \brief  Length for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_OFF (0u)

/** \brief  Length for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_OFF (30u)

/** \brief  Length for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_OFF (29u)

/** \brief  Length for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_OFF (28u)

/** \brief  Length for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_OFF (30u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_LEN (4u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_LEN (4u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_LEN (4u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_LEN (4u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_OFF (24u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL1_SYNCDIV_LEN (3u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL1_SYNCDIV_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL1_SYNCDIV_OFF (28u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.TOFF */
#define IFX_SCU_EVRSDCTRL1_TOFF_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.TOFF */
#define IFX_SCU_EVRSDCTRL1_TOFF_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.TOFF */
#define IFX_SCU_EVRSDCTRL1_TOFF_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.TON */
#define IFX_SCU_EVRSDCTRL1_TON_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.TON */
#define IFX_SCU_EVRSDCTRL1_TON_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.TON */
#define IFX_SCU_EVRSDCTRL1_TON_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.ADCLPF */
#define IFX_SCU_EVRSDCTRL2_ADCLPF_LEN (2u)

