leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.ADCLPF */
#define IFX_SCU_EVRSDCTRL2_ADCLPF_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.ADCLPF */
#define IFX_SCU_EVRSDCTRL2_ADCLPF_OFF (20u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.ADCLSB */
#define IFX_SCU_EVRSDCTRL2_ADCLSB_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.ADCLSB */
#define IFX_SCU_EVRSDCTRL2_ADCLSB_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.ADCLSB */
#define IFX_SCU_EVRSDCTRL2_ADCLSB_OFF (22u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.ADCMODE */
#define IFX_SCU_EVRSDCTRL2_ADCMODE_LEN (4u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.ADCMODE */
#define IFX_SCU_EVRSDCTRL2_ADCMODE_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.ADCMODE */
#define IFX_SCU_EVRSDCTRL2_ADCMODE_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.NS */
#define IFX_SCU_EVRSDCTRL2_NS_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.NS */
#define IFX_SCU_EVRSDCTRL2_NS_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.NS */
#define IFX_SCU_EVRSDCTRL2_NS_OFF (12u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.OL */
#define IFX_SCU_EVRSDCTRL2_OL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.OL */
#define IFX_SCU_EVRSDCTRL2_OL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.OL */
#define IFX_SCU_EVRSDCTRL2_OL_OFF (14u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.PIAD */
#define IFX_SCU_EVRSDCTRL2_PIAD_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.PIAD */
#define IFX_SCU_EVRSDCTRL2_PIAD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.PIAD */
#define IFX_SCU_EVRSDCTRL2_PIAD_OFF (15u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_LEN (6u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_OFF (24u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.STBS */
#define IFX_SCU_EVRSDCTRL2_STBS_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.STBS */
#define IFX_SCU_EVRSDCTRL2_STBS_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.STBS */
#define IFX_SCU_EVRSDCTRL2_STBS_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.STSP */
#define IFX_SCU_EVRSDCTRL2_STSP_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.STSP */
#define IFX_SCU_EVRSDCTRL2_STSP_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.STSP */
#define IFX_SCU_EVRSDCTRL2_STSP_OFF (10u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.MODHIGH */
#define IFX_SCU_EVRSDCTRL3_MODHIGH_LEN (7u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.MODHIGH */
#define IFX_SCU_EVRSDCTRL3_MODHIGH_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.MODHIGH */
#define IFX_SCU_EVRSDCTRL3_MODHIGH_OFF (24u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.MODLOW */
#define IFX_SCU_EVRSDCTRL3_MODLOW_LEN (7u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.MODLOW */
#define IFX_SCU_EVRSDCTRL3_MODLOW_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.MODLOW */
#define IFX_SCU_EVRSDCTRL3_MODLOW_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.MODMAN */
#define IFX_SCU_EVRSDCTRL3_MODMAN_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.MODMAN */
#define IFX_SCU_EVRSDCTRL3_MODMAN_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.MODMAN */
#define IFX_SCU_EVRSDCTRL3_MODMAN_OFF (22u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.MODSEL */
#define IFX_SCU_EVRSDCTRL3_MODSEL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.MODSEL */
#define IFX_SCU_EVRSDCTRL3_MODSEL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.MODSEL */
#define IFX_SCU_EVRSDCTRL3_MODSEL_OFF (7u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDOLCON */
#define IFX_SCU_EVRSDCTRL3_SDOLCON_LEN (7u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDOLCON */
#define IFX_SCU_EVRSDCTRL3_SDOLCON_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDOLCON */
#define IFX_SCU_EVRSDCTRL3_SDOLCON_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_LEN (6u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_OFF (10u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_OFF (1u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_OFF (4u)

