leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.SCMOD */
#define IFX_SCU_EVRSTAT_SCMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.SCMOD */
#define IFX_SCU_EVRSTAT_SCMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.SCMOD */
#define IFX_SCU_EVRSTAT_SCMOD_OFF (12u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_OFF (5u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_OFF (7u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_OFF (30u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_OFF (16u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_LEN (8u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_OFF (24u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_LEN (1u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_OFF (0u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_LEN (1u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_OFF (16u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_OFF (17u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_LEN (4u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_OFF (2u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_LEN (4u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_OFF (18u)

/** \brief  Length for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_LEN (1u)

/** \brief  Mask for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_OFF (31u)

/** \brief  Length for Ifx_SCU_FDR_Bits.DM */
#define IFX_SCU_FDR_DM_LEN (2u)

/** \brief  Mask for Ifx_SCU_FDR_Bits.DM */
#define IFX_SCU_FDR_DM_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_FDR_Bits.DM */
#define IFX_SCU_FDR_DM_OFF (14u)

/** \brief  Length for Ifx_SCU_FDR_Bits.RESULT */
#define IFX_SCU_FDR_RESULT_LEN (10u)

/** \brief  Mask for Ifx_SCU_FDR_Bits.RESULT */
#define IFX_SCU_FDR_RESULT_MSK (0x3ffu)

/** \brief  Offset for Ifx_SCU_FDR_Bits.RESULT */
#define IFX_SCU_FDR_RESULT_OFF (16u)

/** \brief  Length for Ifx_SCU_FDR_Bits.STEP */
#define IFX_SCU_FDR_STEP_LEN (10u)

/** \brief  Mask for Ifx_SCU_FDR_Bits.STEP */
#define IFX_SCU_FDR_STEP_MSK (0x3ffu)

/** \brief  Offset for Ifx_SCU_FDR_Bits.STEP */
#define IFX_SCU_FDR_STEP_OFF (0u)

/** \brief  Length for Ifx_SCU_FMR_Bits.FC0 */
#define IFX_SCU_FMR_FC0_LEN (1u)

/** \brief  Mask for Ifx_SCU_FMR_Bits.FC0 */
#define IFX_SCU_FMR_FC0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_FMR_Bits.FC0 */
#define IFX_SCU_FMR_FC0_OFF (16u)

/** \brief  Length for Ifx_SCU_FMR_Bits.FC1 */
#define IFX_SCU_FMR_FC1_LEN (1u)

/** \brief  Mask for Ifx_SCU_FMR_Bits.FC1 */
#define IFX_SCU_FMR_FC1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_FMR_Bits.FC1 */
#define IFX_SCU_FMR_FC1_OFF (17u)

/** \brief  Length for Ifx_SCU_FMR_Bits.FC2 */
#define IFX_SCU_FMR_FC2_LEN (1u)

/** \brief  Mask for Ifx_SCU_FMR_Bits.FC2 */
#define IFX_SCU_FMR_FC2_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_FMR_Bits.FC2 */
#define IFX_SCU_FMR_FC2_OFF (18u)

/** \brief  Length for Ifx_SCU_FMR_Bits.FC3 */
#define IFX_SCU_FMR_FC3_LEN (1u)

/** \brief  Mask for Ifx_SCU_FMR_Bits.FC3 */
#define IFX_SCU_FMR_FC3_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_FMR_Bits.FC3 */
#define IFX_SCU_FMR_FC3_OFF (19u)

/** \brief  Length for Ifx_SCU_FMR_Bits.FC4 */
#define IFX_SCU_FMR_FC4_LEN (1u)

/** \brief  Mask for Ifx_SCU_FMR_Bits.FC4 */
#define IFX_SCU_FMR_FC4_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_FMR_Bits.FC4 */
#define IFX_SCU_FMR_FC4_OFF (20u)

/** \brief  Length for Ifx_SCU_FMR_Bits.FC5 */
#define IFX_SCU_FMR_FC5_LEN (1u)

/** \brief  Mask for Ifx_SCU_FMR_Bits.FC5 */
#define IFX_SCU_FMR_FC5_MSK (0x1u)

