leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Length for Ifx_SCU_PLLCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLCON0_CLRFINDIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLCON0_CLRFINDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLCON0_CLRFINDIS_OFF (5u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.MODEN */
#define IFX_SCU_PLLCON0_MODEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.MODEN */
#define IFX_SCU_PLLCON0_MODEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.MODEN */
#define IFX_SCU_PLLCON0_MODEN_OFF (2u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.NDIV */
#define IFX_SCU_PLLCON0_NDIV_LEN (7u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.NDIV */
#define IFX_SCU_PLLCON0_NDIV_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.NDIV */
#define IFX_SCU_PLLCON0_NDIV_OFF (9u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLCON0_OSCDISCDIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLCON0_OSCDISCDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLCON0_OSCDISCDIS_OFF (6u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.PDIV */
#define IFX_SCU_PLLCON0_PDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.PDIV */
#define IFX_SCU_PLLCON0_PDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.PDIV */
#define IFX_SCU_PLLCON0_PDIV_OFF (24u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.PLLPWD */
#define IFX_SCU_PLLCON0_PLLPWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.PLLPWD */
#define IFX_SCU_PLLCON0_PLLPWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.PLLPWD */
#define IFX_SCU_PLLCON0_PLLPWD_OFF (16u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.RESLD */
#define IFX_SCU_PLLCON0_RESLD_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.RESLD */
#define IFX_SCU_PLLCON0_RESLD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.RESLD */
#define IFX_SCU_PLLCON0_RESLD_OFF (18u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLCON0_SETFINDIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLCON0_SETFINDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLCON0_SETFINDIS_OFF (4u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.VCOBYP */
#define IFX_SCU_PLLCON0_VCOBYP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.VCOBYP */
#define IFX_SCU_PLLCON0_VCOBYP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.VCOBYP */
#define IFX_SCU_PLLCON0_VCOBYP_OFF (0u)

/** \brief  Length for Ifx_SCU_PLLCON0_Bits.VCOPWD */
#define IFX_SCU_PLLCON0_VCOPWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLCON0_Bits.VCOPWD */
#define IFX_SCU_PLLCON0_VCOPWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLCON0_Bits.VCOPWD */
#define IFX_SCU_PLLCON0_VCOPWD_OFF (1u)

/** \brief  Length for Ifx_SCU_PLLCON1_Bits.K1DIV */
#define IFX_SCU_PLLCON1_K1DIV_LEN (7u)

/** \brief  Mask for Ifx_SCU_PLLCON1_Bits.K1DIV */
#define IFX_SCU_PLLCON1_K1DIV_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_PLLCON1_Bits.K1DIV */
#define IFX_SCU_PLLCON1_K1DIV_OFF (16u)

/** \brief  Length for Ifx_SCU_PLLCON1_Bits.K2DIV */
#define IFX_SCU_PLLCON1_K2DIV_LEN (7u)

/** \brief  Mask for Ifx_SCU_PLLCON1_Bits.K2DIV */
#define IFX_SCU_PLLCON1_K2DIV_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_PLLCON1_Bits.K2DIV */
#define IFX_SCU_PLLCON1_K2DIV_OFF (0u)

/** \brief  Length for Ifx_SCU_PLLCON1_Bits.K3DIV */
#define IFX_SCU_PLLCON1_K3DIV_LEN (7u)

/** \brief  Mask for Ifx_SCU_PLLCON1_Bits.K3DIV */
#define IFX_SCU_PLLCON1_K3DIV_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_PLLCON1_Bits.K3DIV */
#define IFX_SCU_PLLCON1_K3DIV_OFF (8u)

/** \brief  Length for Ifx_SCU_PLLCON2_Bits.MODCFG */
#define IFX_SCU_PLLCON2_MODCFG_LEN (16u)

/** \brief  Mask for Ifx_SCU_PLLCON2_Bits.MODCFG */
#define IFX_SCU_PLLCON2_MODCFG_MSK (0xffffu)

/** \brief  Offset for Ifx_SCU_PLLCON2_Bits.MODCFG */
#define IFX_SCU_PLLCON2_MODCFG_OFF (0u)

/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLERAYCON0_CLRFINDIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLERAYCON0_CLRFINDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.CLRFINDIS */
#define IFX_SCU_PLLERAYCON0_CLRFINDIS_OFF (5u)

/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.NDIV */
#define IFX_SCU_PLLERAYCON0_NDIV_LEN (5u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.NDIV */
#define IFX_SCU_PLLERAYCON0_NDIV_MSK (0x1fu)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.NDIV */
#define IFX_SCU_PLLERAYCON0_NDIV_OFF (9u)

/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLERAYCON0_OSCDISCDIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLERAYCON0_OSCDISCDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.OSCDISCDIS */
#define IFX_SCU_PLLERAYCON0_OSCDISCDIS_OFF (6u)

/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.PDIV */
#define IFX_SCU_PLLERAYCON0_PDIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.PDIV */
#define IFX_SCU_PLLERAYCON0_PDIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.PDIV */
#define IFX_SCU_PLLERAYCON0_PDIV_OFF (24u)

/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.PLLPWD */
#define IFX_SCU_PLLERAYCON0_PLLPWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.PLLPWD */
#define IFX_SCU_PLLERAYCON0_PLLPWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.PLLPWD */
#define IFX_SCU_PLLERAYCON0_PLLPWD_OFF (16u)

/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.RESLD */
#define IFX_SCU_PLLERAYCON0_RESLD_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.RESLD */
#define IFX_SCU_PLLERAYCON0_RESLD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.RESLD */
#define IFX_SCU_PLLERAYCON0_RESLD_OFF (18u)

/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLERAYCON0_SETFINDIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLERAYCON0_SETFINDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.SETFINDIS */
#define IFX_SCU_PLLERAYCON0_SETFINDIS_OFF (4u)

/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.VCOBYP */
#define IFX_SCU_PLLERAYCON0_VCOBYP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.VCOBYP */
#define IFX_SCU_PLLERAYCON0_VCOBYP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.VCOBYP */
#define IFX_SCU_PLLERAYCON0_VCOBYP_OFF (0u)

