leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Length for Ifx_SCU_PLLERAYCON0_Bits.VCOPWD */
#define IFX_SCU_PLLERAYCON0_VCOPWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON0_Bits.VCOPWD */
#define IFX_SCU_PLLERAYCON0_VCOPWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYCON0_Bits.VCOPWD */
#define IFX_SCU_PLLERAYCON0_VCOPWD_OFF (1u)

/** \brief  Length for Ifx_SCU_PLLERAYCON1_Bits.K1DIV */
#define IFX_SCU_PLLERAYCON1_K1DIV_LEN (7u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON1_Bits.K1DIV */
#define IFX_SCU_PLLERAYCON1_K1DIV_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_PLLERAYCON1_Bits.K1DIV */
#define IFX_SCU_PLLERAYCON1_K1DIV_OFF (16u)

/** \brief  Length for Ifx_SCU_PLLERAYCON1_Bits.K2DIV */
#define IFX_SCU_PLLERAYCON1_K2DIV_LEN (7u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON1_Bits.K2DIV */
#define IFX_SCU_PLLERAYCON1_K2DIV_MSK (0x7fu)

/** \brief  Offset for Ifx_SCU_PLLERAYCON1_Bits.K2DIV */
#define IFX_SCU_PLLERAYCON1_K2DIV_OFF (0u)

/** \brief  Length for Ifx_SCU_PLLERAYCON1_Bits.K3DIV */
#define IFX_SCU_PLLERAYCON1_K3DIV_LEN (4u)

/** \brief  Mask for Ifx_SCU_PLLERAYCON1_Bits.K3DIV */
#define IFX_SCU_PLLERAYCON1_K3DIV_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_PLLERAYCON1_Bits.K3DIV */
#define IFX_SCU_PLLERAYCON1_K3DIV_OFF (8u)

/** \brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.FINDIS */
#define IFX_SCU_PLLERAYSTAT_FINDIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.FINDIS */
#define IFX_SCU_PLLERAYSTAT_FINDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.FINDIS */
#define IFX_SCU_PLLERAYSTAT_FINDIS_OFF (3u)

/** \brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.K1RDY */
#define IFX_SCU_PLLERAYSTAT_K1RDY_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.K1RDY */
#define IFX_SCU_PLLERAYSTAT_K1RDY_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.K1RDY */
#define IFX_SCU_PLLERAYSTAT_K1RDY_OFF (4u)

/** \brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.K2RDY */
#define IFX_SCU_PLLERAYSTAT_K2RDY_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.K2RDY */
#define IFX_SCU_PLLERAYSTAT_K2RDY_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.K2RDY */
#define IFX_SCU_PLLERAYSTAT_K2RDY_OFF (5u)

/** \brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLERAYSTAT_PWDSTAT_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLERAYSTAT_PWDSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.PWDSTAT */
#define IFX_SCU_PLLERAYSTAT_PWDSTAT_OFF (1u)

/** \brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLERAYSTAT_VCOBYST_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLERAYSTAT_VCOBYST_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLERAYSTAT_VCOBYST_OFF (0u)

/** \brief  Length for Ifx_SCU_PLLERAYSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLERAYSTAT_VCOLOCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLERAYSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLERAYSTAT_VCOLOCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLERAYSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLERAYSTAT_VCOLOCK_OFF (2u)

/** \brief  Length for Ifx_SCU_PLLSTAT_Bits.FINDIS */
#define IFX_SCU_PLLSTAT_FINDIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLSTAT_Bits.FINDIS */
#define IFX_SCU_PLLSTAT_FINDIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLSTAT_Bits.FINDIS */
#define IFX_SCU_PLLSTAT_FINDIS_OFF (3u)

/** \brief  Length for Ifx_SCU_PLLSTAT_Bits.K1RDY */
#define IFX_SCU_PLLSTAT_K1RDY_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLSTAT_Bits.K1RDY */
#define IFX_SCU_PLLSTAT_K1RDY_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLSTAT_Bits.K1RDY */
#define IFX_SCU_PLLSTAT_K1RDY_OFF (4u)

/** \brief  Length for Ifx_SCU_PLLSTAT_Bits.K2RDY */
#define IFX_SCU_PLLSTAT_K2RDY_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLSTAT_Bits.K2RDY */
#define IFX_SCU_PLLSTAT_K2RDY_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLSTAT_Bits.K2RDY */
#define IFX_SCU_PLLSTAT_K2RDY_OFF (5u)

/** \brief  Length for Ifx_SCU_PLLSTAT_Bits.MODRUN */
#define IFX_SCU_PLLSTAT_MODRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLSTAT_Bits.MODRUN */
#define IFX_SCU_PLLSTAT_MODRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLSTAT_Bits.MODRUN */
#define IFX_SCU_PLLSTAT_MODRUN_OFF (7u)

/** \brief  Length for Ifx_SCU_PLLSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLSTAT_VCOBYST_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLSTAT_VCOBYST_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLSTAT_Bits.VCOBYST */
#define IFX_SCU_PLLSTAT_VCOBYST_OFF (0u)

/** \brief  Length for Ifx_SCU_PLLSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLSTAT_VCOLOCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_PLLSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLSTAT_VCOLOCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PLLSTAT_Bits.VCOLOCK */
#define IFX_SCU_PLLSTAT_VCOLOCK_OFF (2u)

/** \brief  Length for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_LEN (3u)

/** \brief  Mask for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_PMCSR_Bits.PMST */
#define IFX_SCU_PMCSR_PMST_OFF (8u)

/** \brief  Length for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_LEN (2u)

/** \brief  Mask for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_PMCSR_Bits.REQSLP */
#define IFX_SCU_PMCSR_REQSLP_OFF (0u)

/** \brief  Length for Ifx_SCU_PMCSR_Bits.SMUSLP */
#define IFX_SCU_PMCSR_SMUSLP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMCSR_Bits.SMUSLP */
#define IFX_SCU_PMCSR_SMUSLP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMCSR_Bits.SMUSLP */
#define IFX_SCU_PMCSR_SMUSLP_OFF (2u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.DCDCSYNC */
#define IFX_SCU_PMSWCR0_DCDCSYNC_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.DCDCSYNC */
#define IFX_SCU_PMSWCR0_DCDCSYNC_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.DCDCSYNC */
#define IFX_SCU_PMSWCR0_DCDCSYNC_OFF (25u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR0DFEN */
#define IFX_SCU_PMSWCR0_ESR0DFEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR0DFEN */
#define IFX_SCU_PMSWCR0_ESR0DFEN_MSK (0x1u)

