leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR0DFEN */
#define IFX_SCU_PMSWCR0_ESR0DFEN_OFF (4u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR0EDCON */
#define IFX_SCU_PMSWCR0_ESR0EDCON_LEN (2u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR0EDCON */
#define IFX_SCU_PMSWCR0_ESR0EDCON_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR0EDCON */
#define IFX_SCU_PMSWCR0_ESR0EDCON_OFF (5u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR0TRIST */
#define IFX_SCU_PMSWCR0_ESR0TRIST_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR0TRIST */
#define IFX_SCU_PMSWCR0_ESR0TRIST_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR0TRIST */
#define IFX_SCU_PMSWCR0_ESR0TRIST_OFF (29u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR1DFEN */
#define IFX_SCU_PMSWCR0_ESR1DFEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR1DFEN */
#define IFX_SCU_PMSWCR0_ESR1DFEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR1DFEN */
#define IFX_SCU_PMSWCR0_ESR1DFEN_OFF (7u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR1EDCON */
#define IFX_SCU_PMSWCR0_ESR1EDCON_LEN (2u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR1EDCON */
#define IFX_SCU_PMSWCR0_ESR1EDCON_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR1EDCON */
#define IFX_SCU_PMSWCR0_ESR1EDCON_OFF (8u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.ESR1WKEN */
#define IFX_SCU_PMSWCR0_ESR1WKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.ESR1WKEN */
#define IFX_SCU_PMSWCR0_ESR1WKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.ESR1WKEN */
#define IFX_SCU_PMSWCR0_ESR1WKEN_OFF (1u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.LCK */
#define IFX_SCU_PMSWCR0_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINADFEN */
#define IFX_SCU_PMSWCR0_PINADFEN_OFF (10u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_LEN (2u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINAEDCON */
#define IFX_SCU_PMSWCR0_PINAEDCON_OFF (11u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINAWKEN */
#define IFX_SCU_PMSWCR0_PINAWKEN_OFF (2u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBDFEN */
#define IFX_SCU_PMSWCR0_PINBDFEN_OFF (13u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_LEN (2u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBEDCON */
#define IFX_SCU_PMSWCR0_PINBEDCON_OFF (14u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_OFF (3u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_OFF (23u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_LEN (2u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_OFF (17u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.WUTWKEN */
#define IFX_SCU_PMSWCR0_WUTWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.WUTWKEN */
#define IFX_SCU_PMSWCR0_WUTWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.WUTWKEN */
#define IFX_SCU_PMSWCR0_WUTWKEN_OFF (20u)

/** \brief  Length for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_OFF (12u)

/** \brief  Length for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_LEN (3u)

/** \brief  Mask for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_OFF (28u)

/** \brief  Length for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_OFF (27u)

/** \brief  Length for Ifx_SCU_PMSWCR3_Bits.LCK */
#define IFX_SCU_PMSWCR3_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR3_Bits.LCK */
#define IFX_SCU_PMSWCR3_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR3_Bits.LCK */
#define IFX_SCU_PMSWCR3_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_PMSWCR3_Bits.WUTDIV */
#define IFX_SCU_PMSWCR3_WUTDIV_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR3_Bits.WUTDIV */
#define IFX_SCU_PMSWCR3_WUTDIV_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR3_Bits.WUTDIV */
#define IFX_SCU_PMSWCR3_WUTDIV_OFF (28u)

/** \brief  Length for Ifx_SCU_PMSWCR3_Bits.WUTEN */
#define IFX_SCU_PMSWCR3_WUTEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR3_Bits.WUTEN */
#define IFX_SCU_PMSWCR3_WUTEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR3_Bits.WUTEN */
#define IFX_SCU_PMSWCR3_WUTEN_OFF (29u)

/** \brief  Length for Ifx_SCU_PMSWCR3_Bits.WUTMODE */
#define IFX_SCU_PMSWCR3_WUTMODE_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR3_Bits.WUTMODE */
#define IFX_SCU_PMSWCR3_WUTMODE_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR3_Bits.WUTMODE */
#define IFX_SCU_PMSWCR3_WUTMODE_OFF (30u)

/** \brief  Length for Ifx_SCU_PMSWCR3_Bits.WUTREL */
#define IFX_SCU_PMSWCR3_WUTREL_LEN (24u)

