leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Mask for Ifx_SCU_PMSWCR3_Bits.WUTREL */
#define IFX_SCU_PMSWCR3_WUTREL_MSK (0xffffffu)

/** \brief  Offset for Ifx_SCU_PMSWCR3_Bits.WUTREL */
#define IFX_SCU_PMSWCR3_WUTREL_OFF (0u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_OFF (27u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_OFF (3u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_OFF (20u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_OFF (2u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_LEN (3u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_OFF (10u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_OFF (5u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_OFF (21u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_OFF (4u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_OFF (7u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBWKEN */
#define IFX_SCU_PMSWSTAT_PINBWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBWKEN */
#define IFX_SCU_PMSWSTAT_PINBWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBWKEN */
#define IFX_SCU_PMSWSTAT_PINBWKEN_OFF (22u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBWKP */
#define IFX_SCU_PMSWSTAT_PINBWKP_OFF (6u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PORSTDF */
#define IFX_SCU_PMSWSTAT_PORSTDF_OFF (9u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_LEN (2u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.STBYRAM */
#define IFX_SCU_PMSWSTAT_STBYRAM_OFF (13u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.WUTEN */
#define IFX_SCU_PMSWSTAT_WUTEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.WUTEN */
#define IFX_SCU_PMSWSTAT_WUTEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.WUTEN */
#define IFX_SCU_PMSWSTAT_WUTEN_OFF (29u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.WUTMODE */
#define IFX_SCU_PMSWSTAT_WUTMODE_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.WUTMODE */
#define IFX_SCU_PMSWSTAT_WUTMODE_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.WUTMODE */
#define IFX_SCU_PMSWSTAT_WUTMODE_OFF (30u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.WUTOVRUN */
#define IFX_SCU_PMSWSTAT_WUTOVRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.WUTOVRUN */
#define IFX_SCU_PMSWSTAT_WUTOVRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.WUTOVRUN */
#define IFX_SCU_PMSWSTAT_WUTOVRUN_OFF (17u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.WUTRUN */
#define IFX_SCU_PMSWSTAT_WUTRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.WUTRUN */
#define IFX_SCU_PMSWSTAT_WUTRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.WUTRUN */
#define IFX_SCU_PMSWSTAT_WUTRUN_OFF (31u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.WUTWKEN */
#define IFX_SCU_PMSWSTAT_WUTWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.WUTWKEN */
#define IFX_SCU_PMSWSTAT_WUTWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.WUTWKEN */
#define IFX_SCU_PMSWSTAT_WUTWKEN_OFF (19u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.WUTWKP */
#define IFX_SCU_PMSWSTAT_WUTWKP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.WUTWKP */
#define IFX_SCU_PMSWSTAT_WUTWKP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.WUTWKP */
#define IFX_SCU_PMSWSTAT_WUTWKP_OFF (16u)

/** \brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_LEN (1u)

