leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_bf.h
/** \brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1OVRUNCLR_OFF (3u)

/** \brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_SCU_PMSWSTATCLR_ESR1WKPCLR_OFF (2u)

/** \brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINAOVRUNCLR_OFF (5u)

/** \brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINAWKPCLR_OFF (4u)

/** \brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_PINBOVRUNCLR_OFF (7u)

/** \brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_SCU_PMSWSTATCLR_PINBWKPCLR_OFF (6u)

/** \brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_WUTOVRUNCLR_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_WUTOVRUNCLR_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_SCU_PMSWSTATCLR_WUTOVRUNCLR_OFF (17u)

/** \brief  Length for Ifx_SCU_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_SCU_PMSWSTATCLR_WUTWKPCLR_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_SCU_PMSWSTATCLR_WUTWKPCLR_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_SCU_PMSWSTATCLR_WUTWKPCLR_OFF (16u)

/** \brief  Length for Ifx_SCU_PMSWUTCNT_Bits.VAL */
#define IFX_SCU_PMSWUTCNT_VAL_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWUTCNT_Bits.VAL */
#define IFX_SCU_PMSWUTCNT_VAL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWUTCNT_Bits.VAL */
#define IFX_SCU_PMSWUTCNT_VAL_OFF (31u)

/** \brief  Length for Ifx_SCU_PMSWUTCNT_Bits.WUTCNT */
#define IFX_SCU_PMSWUTCNT_WUTCNT_LEN (24u)

/** \brief  Mask for Ifx_SCU_PMSWUTCNT_Bits.WUTCNT */
#define IFX_SCU_PMSWUTCNT_WUTCNT_MSK (0xffffffu)

/** \brief  Offset for Ifx_SCU_PMSWUTCNT_Bits.WUTCNT */
#define IFX_SCU_PMSWUTCNT_WUTCNT_OFF (0u)

/** \brief  Length for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_LEN (1u)

/** \brief  Mask for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_OFF (1u)

/** \brief  Length for Ifx_SCU_RSTCON2_Bits.CSS0 */
#define IFX_SCU_RSTCON2_CSS0_LEN (1u)

/** \brief  Mask for Ifx_SCU_RSTCON2_Bits.CSS0 */
#define IFX_SCU_RSTCON2_CSS0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_RSTCON2_Bits.CSS0 */
#define IFX_SCU_RSTCON2_CSS0_OFF (12u)

/** \brief  Length for Ifx_SCU_RSTCON2_Bits.CSS1 */
#define IFX_SCU_RSTCON2_CSS1_LEN (1u)

/** \brief  Mask for Ifx_SCU_RSTCON2_Bits.CSS1 */
#define IFX_SCU_RSTCON2_CSS1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_RSTCON2_Bits.CSS1 */
#define IFX_SCU_RSTCON2_CSS1_OFF (13u)

/** \brief  Length for Ifx_SCU_RSTCON2_Bits.CSS2 */
#define IFX_SCU_RSTCON2_CSS2_LEN (1u)

/** \brief  Mask for Ifx_SCU_RSTCON2_Bits.CSS2 */
#define IFX_SCU_RSTCON2_CSS2_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_RSTCON2_Bits.CSS2 */
#define IFX_SCU_RSTCON2_CSS2_OFF (14u)

/** \brief  Length for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_LEN (16u)

/** \brief  Mask for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_MSK (0xffffu)

/** \brief  Offset for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_OFF (16u)

/** \brief  Length for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_LEN (2u)

/** \brief  Mask for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_RSTCON_Bits.ESR0 */
#define IFX_SCU_RSTCON_ESR0_OFF (0u)

/** \brief  Length for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_LEN (2u)

/** \brief  Mask for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_RSTCON_Bits.ESR1 */
#define IFX_SCU_RSTCON_ESR1_OFF (2u)

/** \brief  Length for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_LEN (2u)

/** \brief  Mask for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_RSTCON_Bits.SMU */
#define IFX_SCU_RSTCON_SMU_OFF (6u)

/** \brief  Length for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_LEN (2u)

/** \brief  Mask for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_OFF (10u)

/** \brief  Length for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_LEN (2u)

/** \brief  Mask for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_OFF (12u)

/** \brief  Length for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_LEN (2u)

/** \brief  Mask for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_OFF (14u)

/** \brief  Length for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_LEN (2u)

/** \brief  Mask for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_RSTCON_Bits.SW */
#define IFX_SCU_RSTCON_SW_OFF (8u)

/** \brief  Length for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_LEN (1u)

/** \brief  Mask for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_RSTSTAT_Bits.CB0 */
#define IFX_SCU_RSTSTAT_CB0_OFF (18u)

/** \brief  Length for Ifx_SCU_RSTSTAT_Bits.CB1 */
#define IFX_SCU_RSTSTAT_CB1_LEN (1u)

/** \brief  Mask for Ifx_SCU_RSTSTAT_Bits.CB1 */
#define IFX_SCU_RSTSTAT_CB1_MSK (0x1u)

